analogdevicesinc/msdk/Examples/MAX32570/MAX32570_Demo_FreeRTOS/src/task_nfc.c
/******************************************************************************
 * Copyright (C) 2022 Maxim Integrated Products, Inc., All rights Reserved.
 * 
 * This software is protected by copyright laws of the United States and
 * of foreign countries. This material may also be protected by patent laws
 * and technology transfer regulations of the United States and of foreign
 * countries. This software is furnished under a license agreement and/or a
 * nondisclosure agreement and may only be used or reproduced in accordance
 * with the terms of those agreements. Dissemination of this information to
 * any party or parties not specified in the license agreement and/or
 * nondisclosure agreement is expressly prohibited.
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
 * OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 *
 * Except as contained in this notice, the name of Maxim Integrated
 * Products, Inc. shall not be used except as stated in the Maxim Integrated
 * Products, Inc. Branding Policy.
 *
 * The mere transfer of this software does not imply any licenses
 * of trade secrets, proprietary technology, copyrights, patents,
 * trademarks, maskwork rights, or any other form of intellectual
 * property whatsoever. Maxim Integrated Products, Inc. retains all
 * ownership rights.
 *
 ******************************************************************************/

/* Global includes */
#include <stdio.h>
#include <string.h>

/* FreeRTOS */
#include <FreeRTOS.h>
#include <task.h>
#include <queue.h>
#include <semphr.h>

#include "MAX32xxx.h"
#include "task_nfc.h"
#include "message.h"

#include "mml_nfc_pcd_port.h"
#include "mml_nfc_pcd_rf_driver.h"
#include "iso14443_3a_flow.h"
#include "iso14443_3a_cmd.h"
#include "iso14443_3b_flow.h"
#include "iso14443_3b_cmd.h"
#include "iso14443_3_common.h"
#include "iso14443_4_transitive.h"
#include "logging.h"
#include "EMV_polling_and_loopback.h"

/******************************         DEFINES     **************************/
#define BEEPER_PORT MXC_GPIO3
#define BEEPER_PIN MXC_GPIO_PIN_3
#define BEEP_PASS_TIME_MS 150
#define BEEP_FAIL_TIME_MS 150

#define BEEP_PASS_TONE 250 //847
#define BEEP_PASS_VOL 25 //84

/******************************     TYPE DEFINES    **************************/
typedef struct {
    uint8_t rapdu[261];
    int32_t rapdu_len;
    uint8_t aid_bin[50];
    int32_t aid_bin_len;
    char application_label[50];
    int32_t application_label_len;
} ppse_response_t;

/*********************************      VARIABLES    *************************/
extern mml_nfc_pcd_analog_params_t current_analog_parameters;

extern xQueueHandle xQueueMain;
static xSemaphoreHandle xNFCLock;
static volatile int g_nfc_active_polling = 0;

/******************************   STATIC FUNCTIONS  **************************/
static void beep_for_success(void)
{
    uint32_t beep_time = 0;
    uint32_t beep_loop_cnt = 0;

    uint32_t tone = BEEP_PASS_TONE;
    uint32_t vol = BEEP_PASS_VOL;
    uint32_t duration_ms = BEEP_PASS_TIME_MS;

    // No timer or pulse train on the buzzer gpio, got to bit bang it
    // 4Khz is maximum tone volume, as the buzzer resonates here
    // Tone set the period, in us

    // Volumes sets the duty cycle us
    beep_time = (duration_ms * 1000) / tone;

    // Correct tone for the requested volume
    tone = tone - vol;

    MXC_GPIO_OutClr(BEEPER_PORT, BEEPER_PIN);

    while (beep_loop_cnt++ < beep_time) {
        MXC_GPIO_OutSet(BEEPER_PORT, BEEPER_PIN);
        mml_nfc_pcd_block_for_us(vol);
        MXC_GPIO_OutClr(BEEPER_PORT, BEEPER_PIN);
        mml_nfc_pcd_block_for_us(tone);
    }

    MXC_GPIO_OutClr(BEEPER_PORT, BEEPER_PIN);
}

static void setup_beeper(void)
{
    mxc_gpio_cfg_t buzzer_out;

    buzzer_out.port = BEEPER_PORT;
    buzzer_out.mask = BEEPER_PIN;
    buzzer_out.pad = MXC_GPIO_PAD_NONE;
    buzzer_out.func = MXC_GPIO_FUNC_OUT;
    // Use 3.3V for louder Buzz
    buzzer_out.vssel = MXC_GPIO_VSSEL_VDDIOH;

    MXC_GPIO_Config(&buzzer_out);
    MXC_GPIO_OutClr(BEEPER_PORT, BEEPER_PIN);
}

static int32_t do_ppse(ppse_response_t *resp)
{
    int32_t ret;
    uint8_t capdu[261] = { 0x00, 0xA4, 0x04, 0x00, 0x0E, '2', 'P', 'A', 'Y', '.',
                           'S',  'Y',  'S',  '.',  'D',  'D', 'F', '0', '1', 0x00 };
    int32_t capdulen = 20;

    logging("CAPDU ");
    hexdump(DBG_LVL_LOG, capdu, capdulen, 1);

    ret = SendAPDU(capdu, capdulen, resp->rapdu, &resp->rapdu_len);

    if (ret) {
        switch (ret) {
        case ISO14443_3_ERR_PROTOCOL:
        case ISO14443_3_ERR_TIMEOUT:
        case ISO14443_3_ERR_TRANSMISSION:
            return RESETPROCEDURE;
        }
    }

    if (resp->rapdu_len <= 2) {
        // 2 bytes should be wrong case.
        warning("Short APDU: %d\n", resp->rapdu_len);
        return RESETPROCEDURE;
    }

    logging("RAPDU ");
    hexdump(DBG_LVL_LOG, resp->rapdu, resp->rapdu_len, 0);

    return ret;
}

// Decode AIDs and figure out card vendor
static int32_t aid_lookup(ppse_response_t *resp)
{
    // VISA
    if (memcmp(resp->aid_bin, (char[]){ 0xA0, 0x00, 0x00, 0x00, 0x03 }, 5) == 0) {
        strncpy(resp->application_label, "VISA", 50);
        resp->application_label_len = 5;
        return ISO14443_3_ERR_SUCCESS;
    }
    if (memcmp(resp->aid_bin, (char[]){ 0xA0, 0x00, 0x00, 0x00, 0x03, 0x10, 0x10 }, 7) == 0) {
        strncpy(resp->application_label, "VISA", 50);
        resp->application_label_len = 5;
        return ISO14443_3_ERR_SUCCESS;
    }
    if (memcmp(resp->aid_bin, (char[]){ 0xA0, 0x00, 0x00, 0x00, 0x98, 0x08, 0x48 }, 7) == 0) {
        strncpy(resp->application_label, "VISA", 50);
        resp->application_label_len = 5;
        return ISO14443_3_ERR_SUCCESS;
    }

    // Master card
    if (memcmp(resp->aid_bin, (uint8_t[]){ 0xA0, 0x00, 0x00, 0x00, 0x04 }, 5) == 0) {
        strncpy(resp->application_label, "Master Card", 50);
        resp->application_label_len = 11;
        return ISO14443_3_ERR_SUCCESS;
    }
    if (memcmp(resp->aid_bin, (char[]){ 0xA0, 0x00, 0x00, 0x00, 0x05 }, 5) == 0) {
        strncpy(resp->application_label, "Master Card", 50);
        resp->application_label_len = 11;
        return ISO14443_3_ERR_SUCCESS;
    }

