analogdevicesinc/msdk/Examples/MAX32570/MAX32570_Demo_FreeRTOS/src/task_nfc.c
    // American express
    if (memcmp(resp->aid_bin, (char[]){ 0xA0, 0x00, 0x00, 0x00, 0x25 }, 5) == 0) {
        strncpy(resp->application_label, "American Express", 50);
        resp->application_label_len = 16;
        return ISO14443_3_ERR_SUCCESS;
    }

    // CB
    if (memcmp(resp->aid_bin, (char[]){ 0xA0, 0x00, 0x00, 0x00, 0x42 }, 5) == 0) {
        strncpy(resp->application_label, "CB", 50);
        resp->application_label_len = 3;
        return ISO14443_3_ERR_SUCCESS;
    }

    // LINK
    if (memcmp(resp->aid_bin, (char[]){ 0xA0, 0x00, 0x00, 0x00, 0x29 }, 5) == 0) {
        strncpy(resp->application_label, "LINK", 50);
        resp->application_label_len = 5;
        return ISO14443_3_ERR_SUCCESS;
    }

    // JCB
    if (memcmp(resp->aid_bin, (char[]){ 0xA0, 0x00, 0x00, 0x00, 0x65 }, 5) == 0) {
        strncpy(resp->application_label, "JCB", 50);
        resp->application_label_len = 4;
        return ISO14443_3_ERR_SUCCESS;
    }

    // Dankort
    if (memcmp(resp->aid_bin, (char[]){ 0xA0, 0x00, 0x00, 0x01, 0x21, 0x10, 0x10 }, 7) == 0) {
        strncpy(resp->application_label, "Dankort", 50);
        resp->application_label_len = 8;
        return ISO14443_3_ERR_SUCCESS;
    }

    // CoGeBan
    if (memcmp(resp->aid_bin, (char[]){ 0xA0, 0x00, 0x00, 0x01, 0x41, 0x00, 0x01 }, 7) == 0) {
        strncpy(resp->application_label, "Banrisul", 50);
        resp->application_label_len = 9;
        return ISO14443_3_ERR_SUCCESS;
    }

    // Discover
    if (memcmp(resp->aid_bin, (char[]){ 0xA0, 0x00, 0x00, 0x01, 0x52, 0x30, 0x10 }, 7) == 0) {
        strncpy(resp->application_label, "Discover", 50);
        resp->application_label_len = 9;
        return ISO14443_3_ERR_SUCCESS;
    }

    // Banrisul
    if (memcmp(resp->aid_bin, (char[]){ 0xA0, 0x00, 0x00, 0x01, 0x54 }, 5) == 0) {
        strncpy(resp->application_label, "Banrisul", 50);
        resp->application_label_len = 9;
        return ISO14443_3_ERR_SUCCESS;
    }

    // Saudi Payments Network
    if (memcmp(resp->aid_bin, (char[]){ 0xA0, 0x00, 0x00, 0x02, 0x28 }, 5) == 0) {
        strncpy(resp->application_label, "Saudi Payments Network", 50);
        resp->application_label_len = 22;
        return ISO14443_3_ERR_SUCCESS;
    }

    // Interac
    if (memcmp(resp->aid_bin, (char[]){ 0xA0, 0x00, 0x00, 0x02, 0x77 }, 5) == 0) {
        strncpy(resp->application_label, "Interac", 50);
        resp->application_label_len = 8;
        return ISO14443_3_ERR_SUCCESS;
    }

    // Discover Card
    if (memcmp(resp->aid_bin, (char[]){ 0xA0, 0x00, 0x00, 0x03, 0x24 }, 5) == 0) {
        strncpy(resp->application_label, "Discover Card", 50);
        resp->application_label_len = 14;
        return ISO14443_3_ERR_SUCCESS;
    }

    // UnionPay
    if (memcmp(resp->aid_bin, (char[]){ 0xA0, 0x00, 0x00, 0x03, 0x33 }, 5) == 0) {
        strncpy(resp->application_label, "UnionPay", 50);
        resp->application_label_len = 9;
        return ISO14443_3_ERR_SUCCESS;
    }

    // Euro Alliance of Payment Schemes
    if (memcmp(resp->aid_bin, (char[]){ 0xA0, 0x00, 0x00, 0x03, 0x59 }, 5) == 0) {
        strncpy(resp->application_label, "Euro Alliance", 50);
        resp->application_label_len = 13;
        return ISO14443_3_ERR_SUCCESS;
    }

    // Verve
    if (memcmp(resp->aid_bin, (char[]){ 0xA0, 0x00, 0x00, 0x03, 0x71 }, 5) == 0) {
        strncpy(resp->application_label, "Verve", 50);
        resp->application_label_len = 6;
        return ISO14443_3_ERR_SUCCESS;
    }

    // The Exchange Network ATM Network
    if (memcmp(resp->aid_bin, (char[]){ 0xA0, 0x00, 0x00, 0x04, 0x39 }, 5) == 0) {
        strncpy(resp->application_label, "Exchange Network ATM", 50);
        resp->application_label_len = 20;
        return ISO14443_3_ERR_SUCCESS;
    }

    // Rupay
    if (memcmp(resp->aid_bin, (char[]){ 0xA0, 0x00, 0x00, 0x05, 0x24, 0x10, 0x10 }, 7) == 0) {
        strncpy(resp->application_label, "Rupay", 50);
        resp->application_label_len = 6;
        return ISO14443_3_ERR_SUCCESS;
    }

    // ???100
    if (memcmp(resp->aid_bin, (char[]){ 0xA0, 0x00, 0x00, 0x04, 0x32, 0x00, 0x01 }, 7) == 0) {
        strncpy(resp->application_label, "???100", 50);
        resp->application_label_len = 7;
        return ISO14443_3_ERR_SUCCESS;
    }

    // ZKA
    if (memcmp(resp->aid_bin, (char[]){ 0xD2, 0x76, 0x00, 0x00, 0x25, 0x45, 0x50, 0x01, 0x00 },
               9) == 0) {
        strncpy(resp->application_label, "ZKA", 50);
        resp->application_label_len = 4;
        return ISO14443_3_ERR_SUCCESS;
    }

    // Bankaxept
    if (memcmp(resp->aid_bin, (char[]){ 0xD5, 0x78, 0x00, 0x00, 0x02, 0x10, 0x10 }, 7) == 0) {
        strncpy(resp->application_label, "Bankaxept", 50);
        resp->application_label_len = 10;
        return ISO14443_3_ERR_SUCCESS;
    }

    // BRADESCO
    if (memcmp(resp->aid_bin, (char[]){ 0xF0, 0x00, 0x00, 0x00, 0x03, 0x00, 0x01 }, 7) == 0) {
        strncpy(resp->application_label, "BRADESCO", 50);
        resp->application_label_len = 9;
        return ISO14443_3_ERR_SUCCESS;
    }

    // Midland
    if (memcmp(resp->aid_bin, (char[]){ 0xA0, 0x00, 0x00, 0x00, 0x24, 0x01 }, 6) == 0) {
        strncpy(resp->application_label, "Midland", 50);
        resp->application_label_len = 8;
        return ISO14443_3_ERR_SUCCESS;
    }

    // PBS
    if (memcmp(resp->aid_bin, (char[]){ 0xA0, 0x00, 0x00, 0x01, 0x21, 0x10, 0x10 }, 7) == 0) {
        strncpy(resp->application_label, "PBS", 50);
        resp->application_label_len = 4;
        return ISO14443_3_ERR_SUCCESS;
    }

    // eTranzact
    if (memcmp(resp->aid_bin, (char[]){ 0xA0, 0x00, 0x00, 0x04, 0x54 }, 5) == 0) {
        strncpy(resp->application_label, "eTranzact", 50);
        resp->application_label_len = 10;
        return ISO14443_3_ERR_SUCCESS;
    }

    // Google
    if (memcmp(resp->aid_bin, (char[]){ 0xA0, 0x00, 0x00, 0x04, 0x76, 0x6C }, 6) == 0) {
        strncpy(resp->application_label, "Google", 50);
        resp->application_label_len = 7;
        return ISO14443_3_ERR_SUCCESS;
    }

    // InterSwitch
    if (memcmp(resp->aid_bin, (char[]){ 0xA0, 0x00, 0x00, 0x03, 0x71, 0x00, 0x01 }, 7) == 0) {
        strncpy(resp->application_label, "InterSwitch", 50);
        resp->application_label_len = 12;
        return ISO14443_3_ERR_SUCCESS;
    }

    return -1;
}

#define FCI_TEMPLATE 0x6F
#define DEDICATED_FILE_TEMPLATE 0x84
#define FCI_PROPRIETARY_TEMPLATE 0xA5
#define FCI_ISSUER_DISCRETIONARY_B0 0xBF
#define FCI_ISSUER_DISCRETIONARY_B1 0x0C
#define APPLICATION_TEMPLATE 0x61
#define APPLICATION_IDENTIFIER 0x4F
#define APPLICATION_LABEL 0x50

