analogdevicesinc/msdk/Examples/MAX32570/MAX32570_Demo_FreeRTOS/src/task_nfc.c
// Inspect ppse response, if valid, lookup Application ID
static int32_t parse_ppse_response(ppse_response_t *resp)
{
    int32_t index = 0;
    int32_t i = 0;
    int32_t fci_prop_len = 0;

    if (resp->rapdu_len < 2) {
        return ISO14443_3_ERR_PROTOCOL;
    }

    // Check for SW success 0x9000
    if ((resp->rapdu[resp->rapdu_len - 1] != 0x00) || (resp->rapdu[resp->rapdu_len - 2] != 0x90)) {
        return ISO14443_3_ERR_PROTOCOL;
    }

    // First comes File Control Information (FCI) Template
    if (resp->rapdu[index++] != FCI_TEMPLATE) {
        return ISO14443_3_ERR_PROTOCOL;
    }

    // This is followed by the length of the FCI
    // Verify we have good length
    if (resp->rapdu[index++] >= resp->rapdu_len) {
        return ISO14443_3_ERR_PROTOCOL;
    }

    // Next is Dedicated File Name (DF)
    if (resp->rapdu[index++] != DEDICATED_FILE_TEMPLATE) {
        return ISO14443_3_ERR_PROTOCOL;
    }

    // This is followed by the length of the Dedicated File (DF) Name
    // Skip the DF for now
    index += resp->rapdu[index];
    index++;
    if (index >= resp->rapdu_len) {
        return ISO14443_3_ERR_PROTOCOL;
    }

    // Next comes File Control Information (FCI) Proprietary Template
    if (resp->rapdu[index++] != FCI_PROPRIETARY_TEMPLATE) {
        return ISO14443_3_ERR_PROTOCOL;
    }

    if (index >= resp->rapdu_len) {
        return ISO14443_3_ERR_PROTOCOL;
    }

    fci_prop_len = resp->rapdu[index++];

    if (index >= resp->rapdu_len) {
        return ISO14443_3_ERR_PROTOCOL;
    }

    // If we have enough data for this we are good to go to get our data
    if (((index - 1) + fci_prop_len) >= resp->rapdu_len) {
        return ISO14443_3_ERR_PROTOCOL;
    }

    if (resp->rapdu[index++] != FCI_ISSUER_DISCRETIONARY_B0) {
        return ISO14443_3_ERR_PROTOCOL;
    }

    if (index >= resp->rapdu_len) {
        return ISO14443_3_ERR_PROTOCOL;
    }

    if (resp->rapdu[index++] != FCI_ISSUER_DISCRETIONARY_B1) {
        return ISO14443_3_ERR_PROTOCOL;
    }

    if (index >= resp->rapdu_len) {
        return ISO14443_3_ERR_PROTOCOL;
    }

    // Skip FCI_ISSUER_DISCRETIONARY length
    index++;

    if (index >= resp->rapdu_len) {
        return ISO14443_3_ERR_PROTOCOL;
    }

    // Next is APPLICATION_TEMPLATE
    if (resp->rapdu[index++] != APPLICATION_TEMPLATE) {
        return ISO14443_3_ERR_PROTOCOL;
    }

    if (index >= resp->rapdu_len) {
        return ISO14443_3_ERR_PROTOCOL;
    }

    // Skip APPLICATION_TEMPLATE len
    index++;

    if (index >= resp->rapdu_len) {
        return ISO14443_3_ERR_PROTOCOL;
    }

    // Next is Application Identifier (AID) - card
    if (resp->rapdu[index++] != APPLICATION_IDENTIFIER) {
        return ISO14443_3_ERR_PROTOCOL;
    }

    if (index >= resp->rapdu_len) {
        return ISO14443_3_ERR_PROTOCOL;
    }

    // Get Application Identifier (AID) len
    resp->aid_bin_len = resp->rapdu[index++];

    if (index >= resp->rapdu_len) {
        return ISO14443_3_ERR_PROTOCOL;
    }

    // Also need binary version to match to card AID
    for (i = 0; i < resp->aid_bin_len; i++) {
        resp->aid_bin[i] = resp->rapdu[index++];

        if (index >= resp->rapdu_len) {
            return ISO14443_3_ERR_PROTOCOL;
        }
    }

    // Finally we get to Application Label
    if (resp->rapdu[index++] != APPLICATION_LABEL) {
        // Some cards don't have this
        // In this case we have to do a AID lookup

        info("No App Label, using lookup of AID\n");
        return aid_lookup(resp);
    }

    info("Got a valid App Label!\n");

    if (index >= resp->rapdu_len) {
        return ISO14443_3_ERR_PROTOCOL;
    }

    // Get Application Label len
    resp->application_label_len = resp->rapdu[index++];

    if (index >= resp->rapdu_len) {
        return ISO14443_3_ERR_PROTOCOL;
    }

    // OK.  Copy the Label into the buffer
    for (i = 0; i < resp->application_label_len; i++) {
        resp->application_label[i] = resp->rapdu[index++];

        if (index >= resp->rapdu_len) {
            return ISO14443_3_ERR_PROTOCOL;
        }
    }

    return ISO14443_3_ERR_SUCCESS;
}

static void decode_MIFARE_type(char *response)
{
    // **************************************************
    // If SAK bit 6 is cleared, this is a non ISO14443-4 Type A
    // card such as MIFARE Classic 1K.
    // Used http://www.nxp.com/documents/application_note/130830.pdf
    // for this decoding
    // **************************************************

    uint8_t sak = get_last_sak();

    if (sak & 0x08) {
        // Bit 4 == 1
        if (sak & 0x10) {
            // Bit 5 == 1
            strncpy(response, "MIFARE 4K\n", 11);
        } else {
            // Bit 5 == 0
            if (sak & 0x01) {
                // Bit 1 == 1
                strncpy(response, "MIFARE Mini\n", 13);
            } else {
                // Bit 1 == 0
                strncpy(response, "MIFARE 1K\n", 11);
            }
        }
    } else {
        // Bit 4 == 0
        if (sak & 0x10) {
            // Bit 5 == 1
            if (sak & 0x01) {
                // Bit 1 == 1
                strncpy(response, "MIFARE Plus 4K SL2\n", 20);
            } else {
                // Bit 1 == 0
                strncpy(response, "MIFARE Plus 2K SL2\n", 20);
            }
        } else {
            // Bit 5 == 0
            if (sak & 0x20) {
                // Bit 6 == 1
                // This version requires RATS etc
                // Is must therfore be compliant, so we should not be here
                // Do nothing
                strncpy(response, "MIFARE ?\n", 10);
            } else {
                // Bit 6 == 0
                strncpy(response, "MIFARE UL\n", 11);
            }
        }
    }
}

/******************************   PUBLIC FUNCTIONS  **************************/
int nfc_init(void)
{
    mml_nfc_pcd_init();
    setup_beeper();

    // ********************************************************************
    // Set the desired default antenna analog configuration
    // ********************************************************************
    if (mml_nfc_pcd_set_analog_config(current_analog_parameters) != MML_NFC_PCD_E_SUCCESS) {
        debug("Failed to get current analog config, possible RF driver version problem\n");
    }

    poweron_operatingfield();
    poweroff_operatingfield();

