analogdevicesinc/msdk/Examples/MAX32570/MAX32570_Demo_FreeRTOS/src/task_nfc.c
    return 0;
}

void nfc_enable_polling(void)
{
    g_nfc_active_polling = 1;
    xSemaphoreGive(xNFCLock);
}

void nfc_disable_polling(void)
{
    g_nfc_active_polling = 0;
    xSemaphoreTake(xNFCLock, 0);
}

void vGetNFCTask(void *pvParameter)
{
    (void)pvParameter;

    int status = 0;
    int i = 0;
    int k = 0;
    char mifare_strn[50] = { 0x00 };
    message_t msgNFC;

    ppse_response_t card_response;

    //g_logging_level = DBG_LVL_NON;

    /* Initialize the NFC reader and wait before enabling */
    nfc_init();

    xNFCLock = xSemaphoreCreateBinary();

    for (;;) {
        while (xSemaphoreTake(xNFCLock, 0xFFFF) != pdTRUE) {
            {
            }
        }

        msgNFC.pcType = 'L';
        msgNFC.len = 0;

        // Keep looking for cards as long as we are active
        while (g_nfc_active_polling) {
            vTaskDelay(10);

            poweron_operatingfield();

            status = emvl1_poll_for_card(1);

            if ((status == TYPE_A_READY) || (status == TYPE_B_READY)) {
                if (do_ppse(&card_response) == ISO14443_3_ERR_SUCCESS) {
                    debug("Got a valid ppse response\n");

                    beep_for_success();

                    status = parse_ppse_response(&card_response);

                    if (status == ISO14443_3_ERR_SUCCESS) {
                        debug("parse ppse success\n");

                        // Got a response, put in buffer
                        msgNFC.pcType = 'N';

                        // pcMessage buffer is only 50 bytes.

                        i = 0;
                        msgNFC.pcMessage[i++] = 'A';
                        msgNFC.pcMessage[i++] = 'I';
                        msgNFC.pcMessage[i++] = 'D';
                        msgNFC.pcMessage[i++] = ':';
                        msgNFC.pcMessage[i++] = ' ';

                        // print in the AID (convert from HEX to ASCII)
                        for (k = 0; ((k < card_response.aid_bin_len) && (i < 50)); k++, i += 2) {
                            // Note, using pointer math for offset here
                            snprintf((char *)msgNFC.pcMessage + i, 50 - i, "%02X ",
                                    card_response.aid_bin[k]);
                        }

                        // Insert Carriage return
                        if (i < 50) {
                            msgNFC.pcMessage[i++] = '\n';
                        }

                        // Now insert Application Label
                        for (k = 0; ((k < card_response.application_label_len) && (i < 50));
                             i++, k++) {
                            msgNFC.pcMessage[i] = card_response.application_label[k];
                        }

                        msgNFC.len = i;

                        debug("Message cnt: %d\n%s\n\n", i, msgNFC.pcMessage);

                        xQueueSendToFront(xQueueMain, &msgNFC, 0);
                        break;
                    } else {
                        debug("Unknown Card\n");

                        // Got a response, put in buffer
                        msgNFC.pcType = 'N';

                        // pcMessage buffer is only 50 bytes.
                        strncpy((char *)msgNFC.pcMessage, "Unknown Card Type", 50);

                        msgNFC.len = 50;

                        xQueueSendToFront(xQueueMain, &msgNFC, 0);
                        break;
                    }
                } else {
                    beep_for_success();

                    debug("Card does not handle PPSE\n");

                    // Got a response, put in buffer
                    msgNFC.pcType = 'N';

                    // pcMessage buffer is only 50 bytes.
                    strncpy((char *)msgNFC.pcMessage, "Card doesn't handle PPSE", 50);

                    msgNFC.len = 50;

                    // Forge success for this card to display message.
                    // It's a success but just doesn't support PPSE
                    status = ISO14443_3_ERR_SUCCESS;

                    xQueueSendToFront(xQueueMain, &msgNFC, 0);
                    break;
                }
            } else if (status == TYPE_A_NON_ISO14443_4_READY) {
                beep_for_success();
                decode_MIFARE_type(mifare_strn);

                msgNFC.pcType = 'N';

                debug("Possible MIFARE Card %s\n", mifare_strn);
                strncpy((char *)msgNFC.pcMessage, mifare_strn, 50);

                // Set len to null termination of string
                for (i = 0; i < 50; i++) {
                    if (msgNFC.pcMessage[i] == 0) {
                        break;
                    }
                }

                msgNFC.len = i;
                xQueueSendToFront(xQueueMain, &msgNFC, 0);
                break;
            } else if (status == TYPE_B_NON_ISO14443_4_READY) {
                beep_for_success();

                msgNFC.pcType = 'N';

                debug("Type B Non ISO14443 Card found.\n");
                strncpy((char *)msgNFC.pcMessage, "Non ISO14443 Type B card found", 50);

                // Set len to null termination of string
                for (i = 0; i < 50; i++) {
                    if (msgNFC.pcMessage[i] == 0) {
                        break;
                    }
                }

                msgNFC.len = i;
                xQueueSendToFront(xQueueMain, &msgNFC, 0);
                break;
            } else if ((status != ISO14443_3_ERR_SUCCESS) || (status == NO_CARD_FOUND)) {
                // No supported card detected
                // or card does not support ppse
                // or application id is not recognizable
                // or NO CARD in the field

                // Keep Trying
                continue;
            }
        } // End of while (1) keep looking for cards

        mml_nfc_pcd_field_off();
    }
}
